
## :white_check_mark: Apply Succeeded (push-server-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/94907)



<pre><code>Apply complete! Resources: 1 added, 1 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_kms_alias.kms_alias: Reading...
aws_cloudwatch_log_group.aws-otel-collector-log-group: Refreshing state... [id=/Backend/Push-Dev/ecs/aws-otel-collector]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/Push-Dev/ecs/app]
data.aws_sqs_queue.token-queue: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_region.region: Reading...
data.aws_sqs_queue.job-queue: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/Push-Dev]
data.aws_caller_identity.caller: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=410318598490]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_sns_topic.backend_notifications: Reading...
data.aws_sqs_queue.job-queue: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/pocket-push-queue]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_sqs_queue.token-queue: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/pocket-push-feedback-queue]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=push-dev-app]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=Push-Dev-TaskExecutionRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=Push-Dev-TaskRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1745999932]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=1038169679]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::410318598490:policy/Push-Dev-TaskRolePolicy]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::410318598490:policy/Push-Dev-TaskExecutionRolePolicy]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=push-dev-app]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=Push-Dev-TaskExecutionRole-20240208190528909800000004]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=Push-Dev-TaskExecutionRole-20240208190528903900000003]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=Push-Dev-TaskRole-20240208190528897600000002]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=Push-Dev]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 1s [id=vpc-012481e83ffa5e152]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0e5ea7bf00db42e11]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/Push-Dev/Push-Dev]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=Push-Dev]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/Push-Dev/Push-Dev]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=Push-Dev-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=Push-Dev-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=Push-Dev Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=Push-Dev Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4 will be updated in-place
  ~ resource "aws_ecs_service" "application_ecs_service_ecs-service_A8BAB5F4" {
        id                                 = "arn:aws:ecs:us-east-1:410318598490:service/Push-Dev/Push-Dev"
        name                               = "Push-Dev"
        tags                               = {
            "environment" = "Dev"
            "service"     = "Push"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:410318598490:task-definition/Push-Dev:34" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:410318598490:task-definition/Push-Dev:34" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:410318598490:task-definition/Push-Dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "410318598490.dkr.ecr.us-east-1.amazonaws.com/push-dev-app:d7be34fef3bb60ed4f674a0d3ddc3256c0ba0e76" -> "410318598490.dkr.ecr.us-east-1.amazonaws.com/push-dev-app:latest"
                    name                   = "app"
                    # (10 unchanged attributes hidden)
                },
                {
                    command                = [
                        "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                    cpu                    = 0
                    environment            = []
                    essential              = true
                    image                  = "amazon/aws-otel-collector"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group             = "/Backend/Push-Dev/ecs/aws-otel-collector"
                            awslogs-multiline-pattern = "^\\S.+"
                            awslogs-region            = "us-east-1"
                            awslogs-stream-prefix     = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "aws-otel-collector"
                    portMappings           = [
                        {
                            containerPort = 4138
                            hostPort      = 4138
                            protocol      = "tcp"
                        },
                        {
                            containerPort = 4137
                            hostPort      = 4137
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    repositoryCredentials  = {
                        credentialsParameter = "arn:aws:secretsmanager:us-east-1:410318598490:secret:Shared/DockerHub"
                    }
                    systemControls         = []
                    volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "Push-Dev" -> (known after apply)
      ~ revision                 = 34 -> (known after apply)
        tags                     = {
            "environment" = "Dev"
            "service"     = "Push"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=Push-Dev]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=Push-Dev]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Modifying... [id=arn:aws:ecs:us-east-1:410318598490:service/Push-Dev/Push-Dev]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Modifications complete after 0s [id=arn:aws:ecs:us-east-1:410318598490:service/Push-Dev/Push-Dev]

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"1390366c-b721-4cbb-b534-9c6b8c8e0ea7","JobName":"push-server_infrastructure_apply_dev","PRNumber":324,"Program":"tfcmt","SHA1":"34c4f9ad56e7ab0452e9a721945b909a71fbede2","Target":"push-server-cdk-dev","Vars":{}} -->